In [1]:
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
data=pd.read_csv("loan_approved.csv")
mean=data['ApplicantIncome'].mean()
std=data['ApplicantIncome'].std()
range=data['ApplicantIncome'].max()-data['ApplicantIncome'].min()
print("Mean:",mean)
print("Standard Deviation:",std)    
print("Range:",range)

Mean: 5403.459283387622
Standard Deviation: 6109.041673387174
Range: 80850

In [2]:
d1=data['ApplicantIncome'].head(5)
d1

0    5849
1    4583
2    3000
3    2583
4    6000
Name: ApplicantIncome, dtype: int64

In [3]:
for idx, value in d1.items():
    z_score = (value - mean) / std
    print(f"Index: {idx}, Income: {value}, Z-Score: {z_score}")

Index: 0, Income: 5849, Z-Score: 0.07293135984867927
Index: 1, Income: 4583, Z-Score: -0.13430245319192863
Index: 2, Income: 3000, Z-Score: -0.3934265653904138
Index: 3, Income: 2583, Z-Score: -0.4616860440933629
Index: 4, Income: 6000, Z-Score: 0.09764882096173755

In [4]:
data['ApplicantIncome'].max()

81000

In [5]:
import numpy as np

In [6]:
print(data['ApplicantIncome'].skew())
print(data['ApplicantIncome'].kurt())

6.539513113994625
60.54067593369113

skewness: highly skewed

kutosis: leptokurtic

In [7]:
print(data['CoapplicantIncome'].skew())
print(data['CoapplicantIncome'].kurt())

7.491531216657306
84.95638421103374

skewness: highly skewed

kutosis: leptokurtic

In [8]:
print(data['LoanAmount'].skew())
print(data['LoanAmount'].kurt())

2.677551679256059
10.40153349029416

skewness: highly skewed

kutosis: leptokurtic

In [9]:
print(data['Loan_Amount_Term'].skew())
print(data['Loan_Amount_Term'].kurtosis())

-2.362414124216269
6.673473692814259

skewness: highly skewed

kutosis: leptokurtic

In [10]:
data['Gender'].unique()

array(['Male', 'Female', nan], dtype=object)

# ONE HOT ENCODING

In [11]:
data['Property_Area'].unique()

array(['Urban', 'Rural', 'Semiurban'], dtype=object)

In [12]:
data['Property_Area'].isna().sum()

np.int64(0)

In [13]:
pd.get_dummies(data['Property_Area'])

     Rural  Semiurban  Urban
0    False      False   True
1     True      False  False
2    False      False   True
3    False      False   True
4    False      False   True
..     ...        ...    ...
609   True      False  False
610   True      False  False
611  False      False   True
612  False      False   True
613  False       True  False

[614 rows x 3 columns]

In [14]:
pd.get_dummies(data['Property_Area'],dtype=int)

     Rural  Semiurban  Urban
0        0          0      1
1        1          0      0
2        0          0      1
3        0          0      1
4        0          0      1
..     ...        ...    ...
609      1          0      0
610      1          0      0
611      0          0      1
612      0          0      1
613      0          1      0

[614 rows x 3 columns]

In [15]:
data['Property_Area'].shape

(614,)

In [16]:
pd.get_dummies(data['Property_Area'],dtype=int).shape

(614, 3)

columns will be  increased

In [17]:
df1=pd.get_dummies(data['Property_Area'],dtype=int,prefix='pa')

In [18]:
df1=pd.get_dummies(data['Property_Area'],dtype=int,prefix='PA',drop_first=True)

the rural column  is deleted as the indferencing can also be made using the other two rules also

In [19]:
data1=pd.concat([data,df1],axis=1).drop(['Property_Area'],axis=1)

In [20]:
data1.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status (Approved),PA_Semiurban,PA_Urban
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Y,0,1
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,N,0,0
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Y,0,1
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Y,0,1
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Y,0,1

In [21]:
df=pd.DataFrame(data)
df.isna().sum()

Loan_ID                    0
Gender                    13
Married                    3
Dependents                15
Education                  0
Self_Employed             32
ApplicantIncome            0
CoapplicantIncome          0
LoanAmount                22
Loan_Amount_Term          14
Credit_History            50
Property_Area              0
Loan_Status (Approved)     0
dtype: int64

In [22]:
df2=pd.get_dummies(data['Gender'],dtype=int,prefix='g',drop_first=True)
data2=pd.concat([data,df2],axis=1).drop(['Gender'],axis=1)
data2.head()

,Loan_ID,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status (Approved),g_Male
0,LP001002,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y,1
1,LP001003,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N,1
2,LP001005,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,1
3,LP001006,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,1
4,LP001008,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y,1

In [23]:
df3=pd.get_dummies(data['Education'],dtype=int,prefix='e',drop_first=True)
data3=pd.concat([data,df3],axis=1).drop(['Education'],axis=1)
data3.head()

,Loan_ID,Gender,Married,Dependents,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status (Approved),e_Not Graduate
0,LP001002,Male,No,0,No,5849,0.0,NaN,360.0,1.0,Urban,Y,0
1,LP001003,Male,Yes,1,No,4583,1508.0,128.0,360.0,1.0,Rural,N,0
2,LP001005,Male,Yes,0,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y,0
3,LP001006,Male,Yes,0,No,2583,2358.0,120.0,360.0,1.0,Urban,Y,1
4,LP001008,Male,No,0,No,6000,0.0,141.0,360.0,1.0,Urban,Y,0

In [24]:
df4=pd.get_dummies(data['Self_Employed'],dtype=int,prefix='s',drop_first=True)
data4=pd.concat([data,df4],axis=1).drop(['Self_Employed'],axis=1)
data4.head()

,Loan_ID,Gender,Married,Dependents,Education,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status (Approved),s_Yes
0,LP001002,Male,No,0,Graduate,5849,0.0,NaN,360.0,1.0,Urban,Y,0
1,LP001003,Male,Yes,1,Graduate,4583,1508.0,128.0,360.0,1.0,Rural,N,0
2,LP001005,Male,Yes,0,Graduate,3000,0.0,66.0,360.0,1.0,Urban,Y,1
3,LP001006,Male,Yes,0,Not Graduate,2583,2358.0,120.0,360.0,1.0,Urban,Y,0
4,LP001008,Male,No,0,Graduate,6000,0.0,141.0,360.0,1.0,Urban,Y,0

In [25]:
data_final=pd.concat([data,df1,df2,df3,df4],axis=1).drop(['Property_Area','Gender','Education','Self_Employed'],axis=1)  
data_final.head()

,Loan_ID,Married,Dependents,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Loan_Status (Approved),PA_Semiurban,PA_Urban,g_Male,e_Not Graduate,s_Yes
0,LP001002,No,0,5849,0.0,NaN,360.0,1.0,Y,0,1,1,0,0
1,LP001003,Yes,1,4583,1508.0,128.0,360.0,1.0,N,0,0,1,0,0
2,LP001005,Yes,0,3000,0.0,66.0,360.0,1.0,Y,0,1,1,0,1
3,LP001006,Yes,0,2583,2358.0,120.0,360.0,1.0,Y,0,1,1,1,0
4,LP001008,No,0,6000,0.0,141.0,360.0,1.0,Y,0,1,1,0,0

# PREPROCESSING NUMERICAL DATA- TRANSFORMERS

In [26]:
data['LoanAmount'].kurtosis()
data['LoanAmount'].skew()

np.float64(2.677551679256059)

In [27]:
from sklearn.preprocessing import PowerTransformer
trans=PowerTransformer(method='yeo-johnson')
la_trans=trans.fit_transform(data[['LoanAmount']])
la_trans.shape
#boxcox method only for positive values
#yeo-johnson method for both positive and negative values
#here LoanAmount has only positive values so we can use both methods

(614, 1)

In [28]:
print("skewness:",pd.Series(la_trans.reshape(614,)).skew())
print("kurtosis:",pd.Series(la_trans.reshape(614,)).kurtosis())
# [[]] instead of [] use this for reshaping because fit_transform returns 2D array
# where skewness function works on 1D array , so we reshape it to 1D array
# that's why we use reshape function

skewness: 0.019766270088758798
kurtosis: 2.256799285517421

# log tranformation

In [29]:
np.log(data['LoanAmount'])#log tranformation

0           NaN
1      4.852030
2      4.189655
3      4.787492
4      4.948760
         ...
609    4.262680
610    3.688879
611    5.533389
612    5.231109
613    4.890349
Name: LoanAmount, Length: 614, dtype: float64

# square transformation

In [30]:
data['LoanAmount']**2#square transformation

0          NaN
1      16384.0
2       4356.0
3      14400.0
4      19881.0
        ...
609     5041.0
610     1600.0
611    64009.0
612    34969.0
613    17689.0
Name: LoanAmount, Length: 614, dtype: float64

In [31]:
data['LoanAmount']**3#cube transformation

0             NaN
1       2097152.0
2        287496.0
3       1728000.0
4       2803221.0
          ...
609      357911.0
610       64000.0
611    16194277.0
612     6539203.0
613     2352637.0
Name: LoanAmount, Length: 614, dtype: float64

In [32]:
data=trans.fit_transform(data[['LoanAmount']])
data.shape

(614, 1)

In [34]:
from sklearn.preprocessing import PowerTransformer
tran=PowerTransformer(method='box-cox')
data=pd.read_csv("loan_approved.csv")
ai_trans=tran.fit_transform(data[['ApplicantIncome']])
ai_trans.shape
print("skewness:",pd.Series(ai_trans.reshape(614,)).skew())
print("kurtosis:",pd.Series(ai_trans.reshape(614,)).kurtosis())

skewness: -0.0925125048077767
kurtosis: 4.778393672309124

In [36]:
ci_trans=trans.fit_transform(data[['CoapplicantIncome']])
ci_trans.shape
print("skewness:",pd.Series(ai_trans.reshape(614,)).skew())
print("kurtosis:",pd.Series(ai_trans.reshape(614,)).kurtosis())

skewness: -0.0925125048077767
kurtosis: 4.778393672309124